# Pandas Basics

In [121]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

## 1. Series

Series is a 1D array-like object containing a sequence of values and an associated array of data labels, called *index*.

In [36]:
a = [4,7,-5,3]
obj = pd.Series(a)
print("obj value:", obj)

print("\nList a times 4:", a*4)
print("\nSeries obj times 4", obj*4)
# index and values

obj value: 0    4
1    7
2   -5
3    3
dtype: int64

List a times 4: [4, 7, -5, 3, 4, 7, -5, 3, 4, 7, -5, 3, 4, 7, -5, 3]

Series obj times 4 0    16
1    28
2   -20
3    12
dtype: int64

Difference between List and Series:
- Math operation "times": 
 * for a list, the list replicates n times 
 * for a series (like the numpy), the value times 4 or the value itself replicates n times if not a number.

In [28]:
b = [4,7,-5,"string"]
obj = pd.Series(b)
print("obj value:", obj)

print("\nList a times 4:", b*4)    # for a list, the list replicates 4 times
print("\nSeries obj times 4", obj*4) # for a series, the value times 4 if a number, or the value replicates 4 time if string.

obj value: 0         4
1         7
2        -5
3    string
dtype: object

List a times 4: [4, 7, -5, 'string', 4, 7, -5, 'string', 4, 7, -5, 'string', 4, 7, -5, 'string']

Series obj times 4 0                          16
1                          28
2                         -20
3    stringstringstringstring
dtype: object

### Values and Index in the Series 
Series has the value and index attributes

In [29]:
# value
print("Values of the series:", obj.values)
# index
print("Indexes of the series:", obj.index)  # like range(4)

Values of the series: [4 7 -5 'string']
Indexes of the series: RangeIndex(start=0, stop=4, step=1)

In [30]:
# Get the value of the series through the index

print("the second value of the series", obj[1])

the second value of the series 7

### Changes the default index of the Series

In [37]:
objs = pd.Series(a, index = ['a','b','c','d'])
print(objs)
print('the index of the series:', objs.index)

a    4
b    7
c   -5
d    3
dtype: int64
the index of the series: Index(['a', 'b', 'c', 'd'], dtype='object')

In [38]:
print('The second item in the series:', objs['b'])

The second item in the series: 7

### Slicing

Using the Boolean Value

In [39]:
objs[objs > 0]

a    4
b    7
d    3
dtype: int64

In [58]:
objs[['a','d']]

a    4
d    3
dtype: int64

Series is **Mutable**.

In [61]:
objs['e'] = 5
objs

a    4
b    7
c   -5
d    3
e    5
dtype: int64

### Consider the Series as a fixed-length ordered dictionary.
If you input a dictionary into a panda seires construction function, the *key* in the dictionary will automatically become the *index* in the series.

In [55]:
state  = {'aa':1, 'bb':2, 'cc':3, 'dd':4}
state_series = pd.Series(state)
state_series

aa    1
bb    2
cc    3
dd    4
dtype: int64

In [56]:
# change the index
state_index = ['aa', 'bb', 'ccc', 'ddd']
state_series2 = pd.Series(state, index = state_index)
state_series2

aa     1.0
bb     2.0
ccc    NaN
ddd    NaN
dtype: float64

In [57]:
state_series + state_series2

aa     2.0
bb     4.0
cc     NaN
ccc    NaN
dd     NaN
ddd    NaN
dtype: float64

In [54]:
state_series.index = state_index
state_series

aa     1
bb     2
ccc    3
ddd    4
dtype: int64

## 2. DataFrame

Intuitively, the dataframe is just like a spreadsheet. An collection of orderred columns, each of which can be a different value type. <br>
The dataframe can be thought of a dictionary of series all sharing the same index.
* The dataframe has a **ROW** and **COLUMN** indexed.

In [90]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)  # change the default index
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### DataFrame has the attributes of **columns** and **index**

We then can change the value of the columns and index.

In [91]:
frame_columns = frame.columns
frame_columns

Index(['state', 'year', 'pop'], dtype='object')

In [92]:
frame_index = frame.index
frame_index

RangeIndex(start=0, stop=6, step=1)

### Index option changes the index

In [94]:
frame = pd.DataFrame(data, index = ['obs1', 'obs2', 'obs3', 'obs4', 'obs5', 'obs6'])  # change the default index
frame

       state  year  pop
obs1    Ohio  2000  1.5
obs2    Ohio  2001  1.7
obs3    Ohio  2002  3.6
obs4  Nevada  2001  2.4
obs5  Nevada  2002  2.9
obs6  Nevada  2003  3.2

### Columns option changes the order of the columns
If you specify a sequence of columns, then the dataframe's columns will be arranged in that order.

In [96]:
frame = pd.DataFrame(data, columns = ['year', 'state', 'pop'], index = ['obs1', 'obs2', 'obs3', 'obs4', 'obs5', 'obs6'])  # the order of the column
frame

      year   state  pop
obs1  2000    Ohio  1.5
obs2  2001    Ohio  1.7
obs3  2002    Ohio  3.6
obs4  2001  Nevada  2.4
obs5  2002  Nevada  2.9
obs6  2003  Nevada  3.2

In [97]:
# when you pass a nonexist column name
frame = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'gdp_pc'], index = ['obs1', 'obs2', 'obs3', 'obs4', 'obs5', 'obs6'])  # the order of the column
frame

      year   state  pop gdp_pc
obs1  2000    Ohio  1.5    NaN
obs2  2001    Ohio  1.7    NaN
obs3  2002    Ohio  3.6    NaN
obs4  2001  Nevada  2.4    NaN
obs5  2002  Nevada  2.9    NaN
obs6  2003  Nevada  3.2    NaN

### Choose multiple columns

In [98]:
frame[['state', 'pop']]

       state  pop
obs1    Ohio  1.5
obs2    Ohio  1.7
obs3    Ohio  3.6
obs4  Nevada  2.4
obs5  Nevada  2.9
obs6  Nevada  3.2

In [99]:
frame['state']

obs1      Ohio
obs2      Ohio
obs3      Ohio
obs4    Nevada
obs5    Nevada
obs6    Nevada
Name: state, dtype: object

In [100]:
frame.state

obs1      Ohio
obs2      Ohio
obs3      Ohio
obs4    Nevada
obs5    Nevada
obs6    Nevada
Name: state, dtype: object

### Choose Multiple Rows

In [101]:
frame.iloc[2]

year      2002
state     Ohio
pop        3.6
gdp_pc     NaN
Name: obs3, dtype: object

In [103]:
# try frame.loc[2]

In [105]:
frame.loc['obs3']

year      2002
state     Ohio
pop        3.6
gdp_pc     NaN
Name: obs3, dtype: object

In [147]:
# try frame.iloc['obs3']
# also try frame.loc['state']

Choose one or more than one typical cells

In [150]:
frame.loc[['obs1', 'obs3'], ['state']]

     state
obs1  Ohio
obs3  Ohio

### Modify the columns or cells

In [120]:
frame.gdp_pc = "NR"
frame

      year   state  pop gdp_pc
obs1  2000    Ohio  1.5     NR
obs2  2001    Ohio  1.7     NR
obs3  2002    Ohio  3.6     NR
obs4  2001  Nevada  2.4     NR
obs5  2002  Nevada  2.9     NR
obs6  2003  Nevada  3.2     NR

In [125]:
frame.gdp_pc = np.arange(60000, 120000, 10000)
frame

      year   state  pop  gdp_pc
obs1  2000    Ohio  1.5   60000
obs2  2001    Ohio  1.7   70000
obs3  2002    Ohio  3.6   80000
obs4  2001  Nevada  2.4   90000
obs5  2002  Nevada  2.9  100000
obs6  2003  Nevada  3.2  110000

In [134]:
# If you assign a Series, then its will be realigned by its labels, inserting missing values in any holes.
debt = pd.Series([1.0, 2.0, 3.0], index=['obs1', 'obs2', 'obs3'])
frame['debt'] = debt
frame

      year   state  pop  gdp_pc  debt
obs1  2000    Ohio  1.5   60000   1.0
obs2  2001    Ohio  1.7   70000   2.0
obs3  2002    Ohio  3.6   80000   3.0
obs4  2001  Nevada  2.4   90000   NaN
obs5  2002  Nevada  2.9  100000   NaN
obs6  2003  Nevada  3.2  110000   NaN

In [145]:
frame['estern'] = (frame['state'] == 'Ohio')
frame['eastern'] = (frame['state'] == 'Ohio')
frame

      year   state  pop  gdp_pc  debt  eastern  estern
obs1  2000    Ohio  1.5   60000   1.0     True    True
obs2  2001    Ohio  1.7   70000   2.0     True    True
obs3  2002    Ohio  3.6   80000   3.0     True    True
obs4  2001  Nevada  2.4   90000   NaN    False   False
obs5  2002  Nevada  2.9  100000   NaN    False   False
obs6  2003  Nevada  3.2  110000   NaN    False   False

In [146]:
del frame['estern']
frame

      year   state  pop  gdp_pc  debt  eastern
obs1  2000    Ohio  1.5   60000   1.0     True
obs2  2001    Ohio  1.7   70000   2.0     True
obs3  2002    Ohio  3.6   80000   3.0     True
obs4  2001  Nevada  2.4   90000   NaN    False
obs5  2002  Nevada  2.9  100000   NaN    False
obs6  2003  Nevada  3.2  110000   NaN    False

### Nested Dict in the construction
If a nested dict is passed to the DataFrame, then pandas will interpret the outer dict keys as the columns, and the inner keys as the row indices. <br>
This is probably because python stores data by columns.

In [153]:
pop = {'Nevada': {2001:2.4, 2002:2.9}, 'Ohio': {2000:1.5, 2001:1.7, 2002:3.6}}
pop_data = pd.DataFrame(pop)
pop_data

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [154]:
# Transpose
pop_data.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

## Index Object: The index object of the data frame is not mutable.

In [157]:
labels = pd.Index(range(5))
labels

RangeIndex(start=0, stop=5, step=1)

In [165]:
obs = pd.Series(range(5), index = labels)
obs

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [166]:
obs2 = pd.Series(range(5), index = range(5))
obs2

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [168]:
obs.index is labels

True